"""
Дано натуральное число. Выведите его последнюю цифру.
"""
x = int(input())
print(x % 10)