"""
Дано положительное действительное число X. Выведите его дробную часть.
"""
x = float(input())
print(x - int(x))
