"""
Дано натуральное число. Найдите число десятков в его десятичной записи.
"""

x = int(input())
print(x // 10 % 10)
