"""
13.3.3. Напишите программу, которая заменяет в строке все символы 'a' на символ 'z' и выводит
на экран результирующую строку.
"""
s = input('Введите строку на англ. языке, содержащую символы "а": \n')
print(f'{s.replace("a", "z")}')
