"""
Напишите программу, которая приветствует пользователя, выводя слово Hello, введенное имя и знаки препинания
по образцу: Hello, Harry!
"""
n = input()
print("Hello, ", n, "!", sep="")

