"""
Даны два целых числа. Выведите значение наименьшего из них.
"""
x = int(input())
y = int(input())
if x < y:
    print(x)
else:
    print(y)
