"""
Даны три целых числа. Выведите значение наименьшего из них.
"""
x = int(input())
y = int(input())
z = int(input())
if x <= y and x <= z:
    print(x)
elif y <= x and y <= z:
    print(y)
elif z <= x and z <= y:
    print(z)
    